app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Format tanggal lahir sebagai password (ddmmyyyy) to md5
        $passwordHash = md5($password);

        // Cari user berdasarkan username tanpa mempertimbangkan level
        $user = $this->userModel->where('username', $username)
                             ->where('deleted_at', null)
                             ->first();