app/Controllers/Jadwal.php

    public function index()
    {
        $data['title'] = 'Jadwal Perkuliahan';

        // Ambil semua program studi untuk dropdown
        $data['program_studi'] = $this->prodiModel->findAll();
---
SELECT *
FROM `program_studi`
WHERE `program_studi`.`deleted_at` IS NULL