app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '4'
SELECT *
FROM `program_studi`
WHERE `nama` = 'Ilmu Komputer'
AND `program_studi`.`deleted_at` IS NULL
 LIMIT 1
SELECT `jadwal_kuliah`.*, `dosen`.`nama_lengkap` as `nama_dosen`
FROM `jadwal_kuliah`
JOIN `dosen` ON `dosen`.`id` = `jadwal_kuliah`.`dosen_id`
WHERE `jadwal_kuliah`.`program_studi_id` = '1'
AND `jadwal_kuliah`.`semester` = '6'
AND `jadwal_kuliah`.`kelas` = 'P1 (pemrog'
AND `jadwal_kuliah`.`status` = 'Aktif'
AND `jadwal_kuliah`.`deleted_at` IS NULL
ORDER BY `hari`, `waktu_mulai`
---
    public function index()
    {
        // Get logged in student data
        $mahasiswa_id = session()->get('related_id');
        $mahasiswa = $this->mahasiswaModel->find($mahasiswa_id);

        if (!$mahasiswa) {
            return redirect()->to('/auth/logout');
        }

        // Get program study ID based on student's program study name
        $prodi = $this->prodiModel->where('nama', $mahasiswa['program_studi'])->first();

        if (!$prodi) {
            return redirect()->back()->with('error', 'Program studi tidak ditemukan');
        }

        // Use student's current semester from database
        $semester_aktif = $mahasiswa['semester'] ?? $this->calculateCurrentSemester($mahasiswa['angkatan']);
        $kelas = $mahasiswa['kelas'] ?? 'Reguler'; // Default to 'Reguler' if class not set

        // Get schedule for current semester and class
        $jadwal_kuliah = $this->jadwalKuliahModel
            ->select('jadwal_kuliah.*, dosen.nama_lengkap as nama_dosen')
            ->join('dosen', 'dosen.id = jadwal_kuliah.dosen_id')
            ->where('jadwal_kuliah.program_studi_id', $prodi['id'])
            ->where('jadwal_kuliah.semester', $semester_aktif)
            ->where('jadwal_kuliah.kelas', $kelas) // Filter by student's class
            ->where('jadwal_kuliah.status', 'Aktif')
            ->where('jadwal_kuliah.deleted_at', null)
            ->orderBy('hari, waktu_mulai') // Sort by day and time
            ->findAll();