app/Models/JadwalModel.php

    public function getJadwal()
    {
        return $this->db->table('jadwal_kuliah j')
            ->select('j.*, d.nama_lengkap as nama_dosen')
            ->join('dosen d', 'd.id = j.dosen_id')
            ->where('j.status', 'Aktif')
            ->get()
            ->getResultArray();
---
SELECT `j`.*, `d`.`nama_lengkap` as `nama_dosen`
FROM `jadwal_kuliah` `j`
JOIN `dosen` `d` ON `d`.`id` = `j`.`dosen_id`
WHERE `j`.`status` = 'Aktif'

    public function getFilteredJadwal($prodi_id = null, $semester = null, $kelas = null)
    {
        $builder = $this->db->table('jadwal_kuliah j')
            ->select('j.*, d.nama_lengkap as nama_dosen')
            ->join('dosen d', 'd.id = j.dosen_id')
            ->where('j.status', 'Aktif');

        if ($prodi_id) {
            $builder->where('j.program_studi_id', $prodi_id);
        }

        if ($semester) {
            $builder->where('j.semester', $semester);
        }

        if ($kelas) {
            $builder->where('j.kelas', $kelas);
        }

        return $builder->get()->getResultArray();
---
SELECT `j`.*, `d`.`nama_lengkap` as `nama_dosen`
FROM `jadwal_kuliah` `j`
JOIN `dosen` `d` ON `d`.`id` = `j`.`dosen_id`
WHERE `j`.`status` = 'Aktif'
AND `j`.`program_studi_id` = '1'
AND `j`.`semester` = '6'
AND `j`.`kelas` = 'P1 (pemrog'

    public function getDistinctClasses()
    {
        return $this->db->table('jadwal_kuliah')
            ->select('kelas')
            ->distinct()
            ->where('status', 'Aktif')
            ->orderBy('kelas')
            ->get()
            ->getResultArray();
---
SELECT DISTINCT `kelas`
FROM `jadwal_kuliah`
WHERE `status` = 'Aktif'
ORDER BY `kelas`